; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l24_p24_c24_g24_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(person-at person1 loc2)
	(person-at person2 loc23)
	(person-at person3 loc9)
	(person-at person4 loc6)
	(person-at person5 loc14)
	(person-at person6 loc8)
	(person-at person7 loc22)
	(person-at person8 loc5)
	(person-at person9 loc15)
	(person-at person10 loc21)
	(person-at person11 loc6)
	(person-at person12 loc4)
	(person-at person13 loc23)
	(person-at person14 loc18)
	(person-at person15 loc20)
	(person-at person16 loc12)
	(person-at person17 loc8)
	(person-at person18 loc23)
	(person-at person19 loc6)
	(person-at person20 loc21)
	(person-at person21 loc20)
	(person-at person22 loc14)
	(person-at person23 loc10)
	(person-at person24 loc5)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person6 medicine)
	(has-content-person person10 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 food)
	(has-content-person person23 medicine)
	(has-content-person person24 food)
))
)

; plan
1. (put-crate-in-carrier crate24 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate24 depot)
   added: (crate-at-space crate24 carrier1 space4)
   goals met: 1 of 25
2. (put-crate-in-carrier crate16 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space3)
   goals met: 1 of 25
3. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 0 of 25
4. (pick-and-drop crate16 loc12 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate16 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 1 of 25
5. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 25
6. (put-crate-in-carrier crate15 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space3)
   goals met: 2 of 25
7. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 1 of 25
8. (pick-and-drop crate24 loc10 drone1 carrier1 space4 person23 medicine)
   deleted: (crate-at-space crate24 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person23 medicine)
   goals met: 2 of 25
9. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 25
10. (put-crate-in-carrier crate23 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate23 depot)
   added: (crate-at-space crate23 carrier1 space4)
   goals met: 3 of 25
11. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 2 of 25
12. (pick-and-drop crate23 loc8 drone1 carrier1 space4 person6 medicine)
   deleted: (crate-at-space crate23 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person6 medicine)
   goals met: 3 of 25
13. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 25
14. (put-crate-in-carrier crate22 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate22 depot)
   added: (crate-at-space crate22 carrier1 space4)
   goals met: 4 of 25
15. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 3 of 25
16. (pick-and-drop crate15 loc5 drone1 carrier1 space3 person24 food)
   deleted: (crate-at-space crate15 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person24 food)
   goals met: 4 of 25
17. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 25
18. (put-crate-in-carrier crate14 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space3)
   goals met: 5 of 25
19. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 4 of 25
20. (pick-and-drop crate14 loc4 drone1 carrier1 space3 person12 food)
   deleted: (crate-at-space crate14 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person12 food)
   goals met: 5 of 25
21. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 25
22. (put-crate-in-carrier crate13 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space3)
   goals met: 6 of 25
23. (put-crate-in-carrier crate21 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate21 depot)
   added: (crate-at-space crate21 carrier1 space2)
   goals met: 6 of 25
24. (move-carrier depot loc23 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   goals met: 5 of 25
25. (pick-and-drop crate21 loc23 drone1 carrier1 space2 person2 medicine)
   deleted: (crate-at-space crate21 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person2 medicine)
   goals met: 6 of 25
26. (pick-and-drop crate13 loc23 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate13 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 7 of 25
27. (move-carrier loc23 depot drone1 carrier1)
   deleted: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 25
28. (put-crate-in-carrier crate12 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space3)
   goals met: 8 of 25
29. (put-crate-in-carrier crate20 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate20 depot)
   added: (crate-at-space crate20 carrier1 space2)
   goals met: 8 of 25
30. (move-carrier depot loc21 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   goals met: 7 of 25
31. (pick-and-drop crate20 loc21 drone1 carrier1 space2 person10 medicine)
   deleted: (crate-at-space crate20 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person10 medicine)
   goals met: 8 of 25
32. (pick-and-drop crate12 loc21 drone1 carrier1 space3 person10 food)
   deleted: (crate-at-space crate12 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person10 food)
   goals met: 9 of 25
33. (move-carrier loc21 depot drone1 carrier1)
   deleted: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 25
34. (put-crate-in-carrier crate11 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space3)
   goals met: 10 of 25
35. (move-carrier depot loc21 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   goals met: 9 of 25
36. (pick-and-drop crate11 loc21 drone1 carrier1 space3 person20 food)
   deleted: (crate-at-space crate11 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person20 food)
   goals met: 10 of 25
37. (move-carrier loc21 depot drone1 carrier1)
   deleted: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 25
38. (put-crate-in-carrier crate10 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space3)
   goals met: 11 of 25
39. (put-crate-in-carrier crate19 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate19 depot)
   added: (crate-at-space crate19 carrier1 space2)
   goals met: 11 of 25
40. (move-carrier depot loc20 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc20) (carrier-at carrier1 loc20)
   goals met: 10 of 25
41. (pick-and-drop crate19 loc20 drone1 carrier1 space2 person15 medicine)
   deleted: (crate-at-space crate19 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person15 medicine)
   goals met: 11 of 25
42. (pick-and-drop crate10 loc20 drone1 carrier1 space3 person21 food)
   deleted: (crate-at-space crate10 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person21 food)
   goals met: 12 of 25
43. (move-carrier loc20 depot drone1 carrier1)
   deleted: (drone-at drone1 loc20) (carrier-at carrier1 loc20)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 25
44. (put-crate-in-carrier crate9 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space3)
   goals met: 13 of 25
45. (put-crate-in-carrier crate18 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate18 depot)
   added: (crate-at-space crate18 carrier1 space2)
   goals met: 13 of 25
46. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 12 of 25
47. (pick-and-drop crate18 loc9 drone1 carrier1 space2 person3 medicine)
   deleted: (crate-at-space crate18 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 medicine)
   goals met: 13 of 25
48. (pick-and-drop crate9 loc9 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate9 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 14 of 25
49. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 25
50. (put-crate-in-carrier crate8 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space3)
   goals met: 15 of 25
51. (put-crate-in-carrier crate17 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space2)
   goals met: 15 of 25
52. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 14 of 25
53. (pick-and-drop crate17 loc6 drone1 carrier1 space2 person11 medicine)
   deleted: (crate-at-space crate17 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person11 medicine)
   goals met: 15 of 25
54. (move-carrier loc6 loc2 drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 15 of 25
55. (pick-and-drop crate22 loc2 drone1 carrier1 space4 person1 medicine)
   deleted: (crate-at-space crate22 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person1 medicine)
   goals met: 16 of 25
56. (pick-and-drop crate8 loc2 drone1 carrier1 space3 person1 food)
   deleted: (crate-at-space crate8 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person1 food)
   goals met: 17 of 25
57. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 18 of 25
58. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 18 of 25
59. (put-crate-in-carrier crate6 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space3)
   goals met: 18 of 25
60. (move-carrier depot loc23 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   goals met: 17 of 25
61. (pick-and-drop crate6 loc23 drone1 carrier1 space3 person13 food)
   deleted: (crate-at-space crate6 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person13 food)
   goals met: 18 of 25
62. (pick-and-drop crate7 loc23 drone1 carrier1 space4 person18 food)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person18 food)
   goals met: 19 of 25
63. (move-carrier loc23 depot drone1 carrier1)
   deleted: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 20 of 25
64. (put-crate-in-carrier crate5 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space4)
   goals met: 20 of 25
65. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 20 of 25
66. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 19 of 25
67. (pick-and-drop crate4 loc14 drone1 carrier1 space3 person5 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person5 food)
   goals met: 20 of 25
68. (pick-and-drop crate5 loc14 drone1 carrier1 space4 person22 food)
   deleted: (crate-at-space crate5 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person22 food)
   goals met: 21 of 25
69. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 22 of 25
70. (put-crate-in-carrier crate3 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space4)
   goals met: 22 of 25
71. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 22 of 25
72. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 21 of 25
73. (pick-and-drop crate2 loc6 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 22 of 25
74. (pick-and-drop crate3 loc6 drone1 carrier1 space4 person11 food)
   deleted: (crate-at-space crate3 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person11 food)
   goals met: 23 of 25
75. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 24 of 25
76. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 24 of 25
77. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 23 of 25
78. (pick-and-drop crate1 loc6 drone1 carrier1 space4 person19 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person19 food)
   goals met: 24 of 25
79. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 25 of 25
